2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
  ret = stai_tcn_network_get_outputs(tcn_network_context, tcn_out, &number_output);
  assert(ret == STAI_SUCCESS);

  for (int i = 0; i < STAI_TCN_NETWORK_OUT_NUM; i++)
    tcn_out_len[i] = info.outputs[i].size_bytes;
#endif

  memset(&fall_state, 0, sizeof(fall_state));
}

static void FallDetection_Update(PosePipeline_t *pipeline)
{
  fall_state.frame_count = pipeline->win_count;

#if FALL_DETECTION_MODEL == FALL_MODEL_GRU
  /* GRU stateful: run every frame, show result after warmup */
  fall_state.window_ready = (pipeline->win_count >= GRU_WARMUP_FRAMES) ? 1u : 0u;

  if (pipeline->win_count == 0)
  {
    fall_state.fall_detected = 0;
    fall_state.fall_score    = 0.0f;
    fall_state.normal_score  = 0.0f;
    fall_state.inference_ms  = 0;
    return;
  }

  /* IN[0]=h1(256B), IN[1]=h2(128B), IN[2]=pose(220B) */
  memcpy(gru_in[0], gru_h1, STAI_GRU_NETWORK_IN_1_SIZE_BYTES);
  memcpy(gru_in[1], gru_h2, STAI_GRU_NETWORK_IN_2_SIZE_BYTES);
  PosePipeline_GetLatestFeature(pipeline, (float32_t *)gru_in[2]);

  /* GRU runs on CPU: no cache maintenance needed for inputs or outputs.
     InvalidateDCache would discard dirty cache lines written by the CPU runtime
     before they reach RAM, causing stale (zero) reads. */
  uint32_t t0 = HAL_GetTick();
  Run_FallInference();
  uint32_t t1 = HAL_GetTick();
  fall_state.inference_ms = t1 - t0;

  memcpy(gru_h1, gru_out[0], STAI_GRU_NETWORK_OUT_1_SIZE_BYTES);
  memcpy(gru_h2, gru_out[2], STAI_GRU_NETWORK_OUT_3_SIZE_BYTES);

  float32_t *logits = (float32_t *)gru_out[1];

#else /* TCN */
  fall_state.window_ready = PosePipeline_WindowFull(pipeline);

  if (!fall_state.window_ready)
  {
    fall_state.fall_detected = 0;
    fall_state.fall_score    = 0.0f;
    fall_state.normal_score  = 0.0f;
    fall_state.inference_ms  = 0;
    return;
  }

  PosePipeline_GetWindowFeaturesFirst(pipeline, (float32_t (*)[POSE_WINDOW_SIZE])tcn_in);
  SCB_CleanDCache_by_Addr(tcn_in, STAI_TCN_NETWORK_IN_1_SIZE_BYTES);

  uint32_t t0 = HAL_GetTick();
  Run_FallInference();
  uint32_t t1 = HAL_GetTick();
  fall_state.inference_ms = t1 - t0;

  SCB_InvalidateDCache_by_Addr(tcn_out[0], tcn_out_len[0]);
  float32_t *logits = (float32_t *)tcn_out[0];
#endif

  if (fall_state.window_ready)
    printf("[%s] %lums\r\n",
           (FALL_DETECTION_MODEL == FALL_MODEL_GRU) ? "GRU" : "TCN",
           fall_state.inference_ms);

  fall_state.normal_logit = logits[0];
  fall_state.fall_logit   = logits[1];

  float32_t max_logit  = (logits[0] > logits[1]) ? logits[0] : logits[1];
  float32_t normal_exp = expf(logits[0] - max_logit);
  float32_t fall_exp   = expf(logits[1] - max_logit);
  float32_t denom      = normal_exp + fall_exp;

  if (denom > 0.0f)
  {
    fall_state.normal_score = normal_exp / denom;
    fall_state.fall_score   = fall_exp   / denom;
  }
  else
  {
    fall_state.normal_score = 0.5f;
    fall_state.fall_score   = 0.5f;
  }

  if (fall_state.window_ready)
    fall_state.fall_detected = (fall_state.fall_score >= fall_state.normal_score) ? 1u : 0u;
}

static void NPURam_enable(void)
{
  __HAL_RCC_NPU_CLK_ENABLE();
  __HAL_RCC_NPU_FORCE_RESET();
  __HAL_RCC_NPU_RELEASE_RESET();

  /* Enable NPU RAMs (4x448KB) */
  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM5_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
}

static void set_clk_sleep_mode(void)
{
  /*** Enable sleep mode support during NPU inference *************************/
  /* Configure peripheral clocks to remain active during sleep mode */
  /* Keep all IP's enabled during WFE so they can wake up CPU. Fine tune
   * this if you want to save maximum power
   */
  __HAL_RCC_XSPI1_CLK_SLEEP_ENABLE();    /* For display frame buffer */
  __HAL_RCC_XSPI2_CLK_SLEEP_ENABLE();    /* For NN weights */
  __HAL_RCC_NPU_CLK_SLEEP_ENABLE();      /* For NN inference */
  __HAL_RCC_CACHEAXI_CLK_SLEEP_ENABLE(); /* For NN inference */
  __HAL_RCC_LTDC_CLK_SLEEP_ENABLE();     /* For display */
  __HAL_RCC_DMA2D_CLK_SLEEP_ENABLE();    /* For display */
  __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE();   /* For camera configuration retention */
  __HAL_RCC_CSI_CLK_SLEEP_ENABLE();      /* For camera configuration retention */

  __HAL_RCC_FLEXRAM_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM1_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM2_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM3_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_SLEEP_ENABLE(); 

}

static void NPUCache_config(void)
{
  npu_cache_enable();
}

static void Security_Config(void)
{
  __HAL_RCC_RIFSC_CLK_ENABLE();
  RIMC_MasterConfig_t RIMC_master = {0};
  RIMC_master.MasterCID = RIF_CID_1;
  RIMC_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_NPU, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DMA2D, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DCMIPP, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1 , &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2 , &RIMC_master);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_NPU , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DMA2D , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_CSI    , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DCMIPP , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDC   , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL1 , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL2 , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
}

